-- eb_page_categroy default data

INSERT INTO `eb_page_categroy` (`id`, `pid`, `type`, `name`, `sort`, `status`, `add_time`) VALUES
(1, 0, 'link', '商城页面', 100, 1, 1626831994),
(2, 0, 'diy', 'DIY页面', 95, 1, 1626831994),
(3, 0, 'product', '商品页面', 90, 1, 1626831994),
(4, 0, 'article', '文章页面', 85, 1, 1626831994),
(6, 0, 'custom', '自定义', 75, 1, 1626831994),
(7, 1, 'link', '商城链接', 100, 1, 1626831994),
(8, 1, 'link', '营销链接', 95, 1, 1626831994),
(9, 2, 'special', 'DIY页面', 100, 1, 1626831994),
(10, 3, 'product_category', '商品分类', 100, 1, 1626831994),
(11, 3, 'product', '商品', 95, 1, 1626831994),
(16, 4, 'news', '文章', 100, 1, 1626831994),
(18, 6, 'custom', '自定义链接', 100, 1, 1626831994),
(19, 7, 'link', '基础链接', 100, 1, 1626831994),
(20, 7, 'link', '个人中心链接', 95, 1, 1626831994),
(26, 8, 'link', '优惠券链接', 75, 1, 1626831994);