<?php
// +----------------------------------------------------------------------
// | CRMEB [ CRMEB赋能开发者，助力企业发展 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2023 https://www.crmeb.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed CRMEB并不是自由软件，未经许可不能去掉CRMEB相关版权
// +----------------------------------------------------------------------
// | Author: CRMEB Team <admin@crmeb.com>
// +----------------------------------------------------------------------
return [

    // 系统程序接收到发送过来的消息，通过此端口推送给对应的客户或者客服，以及后台新订单弹窗提醒
    'channel' => [
        //内部通讯监听端口
        'port' => 40003,
        //内部通讯地址
        'ip' => '127.0.0.1',
    ],

    // notice 新订单和新退款单发送消息给程序，后台的消息通知
    'admin' => [
        //协议
        'protocol' => 'websocket',
        //监听地址
        'ip' => '0.0.0.0',
        //监听端口
        'port' => 40001,
        //设置当前Worker实例启动多少个进程
        'serverCount' => 1,
    ],

    // msg 客户或者客服发送消息给程序，客服消息通知
    'chat' => [
        //协议
        'protocol' => 'websocket',
        //监听地址
        'ip' => '0.0.0.0',
        //监听端口
        'port' => 40002,
        //设置当前Worker实例启动多少个进程
        'serverCount' => 1,
    ],
];
