<?php
// +----------------------------------------------------------------------
// | CRMEB [ CRMEB赋能开发者，助力企业发展 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2020 https://www.crmeb.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed CRMEB并不是自由软件，未经许可不能去掉CRMEB相关版权
// +----------------------------------------------------------------------
// | Author: CRMEB Team <admin@crmeb.com>
// +----------------------------------------------------------------------

return [

    // 商品
    'product' => [
        // 更新相关
        'Please select product category' => '请选择商品分类',
        'Please enter the product name' => '请输入商品名称',
        'Please upload the slide image' => '请上传商品轮播图',
    ],

    // 订单
    'order' => [

    ]
];