<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Date Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the date library. Each line can
    | have a singular and plural translation separated by a '|'.
    |
    */

    'ago' => 'πριν από :time',
    'from_now' => 'σε :time από τώρα',
    'after' => ':time μετά',
    'before' => ':time πριν',
    'year' => '1 χρόνο|:count χρόνια',
    'month' => '1 μήνα|:count μήνες',
    'week' => '1 εβδομάδα|:count εβδομάδες',
    'day' => '1 μέρα|:count μέρες',
    'hour' => '1 ώρα|:count ώρες',
    'minute' => '1 λεπτό|:count λεπτά',
    'second' => '1 δευτερόλεπτο|:count δευτερόλεπτα',

    'january' => '{0}Ιανουάριος|{1}Ιανουαρίου',
    'february' => '{0}Φεβρουάριος|{1}Φεβρουαρίου',
    'march' => '{0}Μάρτιος|{1}Μαρτίου',
    'april' => '{0}Απρίλιος|{1}Απριλίου',
    'may' => '{0}Μάιος|{1}Μαΐου',
    'june' => '{0}Ιούνιος|{1}Ιουνίου',
    'july' => '{0}Ιούλιος|{1}Ιουλίου',
    'august' => '{0}Αύγουστος|{1}Αυγούστου',
    'september' => '{0}Σεπτέμβριος|{1}Σεπτεμβρίου',
    'october' => '{0}Οκτώβριος|{1}Οκτωβρίου',
    'november' => '{0}Νοέμβριος|{1}Νοεμβρίου',
    'december' => '{0}Δεκέμβριος|{1}Δεκεμβρίου',

    'monday' => 'Δευτέρα',
    'tuesday' => 'Τρίτη',
    'wednesday' => 'Τετάρτη',
    'thursday' => 'Πέμπτη',
    'friday' => 'Παρασκευή',
    'saturday' => 'Σάββατο',
    'sunday' => 'Κυριακή',

    'am' => 'πμ',
    'pm' => 'μμ',
];
